---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetInLinePartTypes
source: html/c7ae31f2-0158-7673-64a8-2b983f8b37bf.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetInLinePartTypes Method

Get a set of element identifiers of fabrication part types for in-line parts.

## Syntax (C#)
```csharp
public ISet<ElementId> GetInLinePartTypes()
```

## Returns
Returns the set of element identifiers for in-line parts or an empty set if there are none.